

<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head><script src="//archive.org/includes/athena.js" type="text/javascript"></script>
<script type="text/javascript">window.addEventListener('DOMContentLoaded',function(){var v=archive_analytics.values;v.service='wb';v.server_name='wwwb-app224.us.archive.org';v.server_ms=658;archive_analytics.send_pageview({});});</script>
<script type="text/javascript" src="https://web-static.archive.org/_static/js/bundle-playback.js?v=1B2M2Y8A" charset="utf-8"></script>
<script type="text/javascript" src="https://web-static.archive.org/_static/js/wombat.js?v=1B2M2Y8A" charset="utf-8"></script>
<script>window.RufflePlayer=window.RufflePlayer||{};window.RufflePlayer.config={"autoplay":"on","unmuteOverlay":"hidden","showSwfDownload":true};</script>
<script type="text/javascript" src="https://web-static.archive.org/_static/js/ruffle/ruffle.js"></script>
<script type="text/javascript">
    __wm.init("https://web.archive.org/web");
  __wm.wombat("https://neo4j.com/docs/operations-manual/3.4/tools/cypher-shell/","20190812123147","https://web.archive.org/","web","https://web-static.archive.org/_static/",
	      "1565613107");
</script>
<link rel="stylesheet" type="text/css" href="https://web-static.archive.org/_static/css/banner-styles.css?v=1B2M2Y8A" />
<link rel="stylesheet" type="text/css" href="https://web-static.archive.org/_static/css/iconochive.css?v=1B2M2Y8A" />
<!-- End Wayback Rewrite JS Include -->

      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>11.9.&nbsp;Cypher Shell - Chapter&nbsp;11.&nbsp;Tools</title>
      <link rel="stylesheet" type="text/css" href="/web/20190812123147cs_/https://neo4j.com/docs/operations-manual/3.4/docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="//web.archive.org/web/20190812123147cs_/https://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="//web.archive.org/web/20190812123147cs_/https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="//web.archive.org/web/20190812123147cs_/https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="//web.archive.org/web/20190812123147cs_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="//web.archive.org/web/20190812123147cs_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="/web/20190812123147cs_/https://neo4j.com/docs/operations-manual/3.4/css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="/web/20190812123147cs_/https://neo4j.com/docs/operations-manual/3.4/css/chunked-base.css"></link><script src="//web.archive.org/web/20190812123147js_/https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/powershell/powershell.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="/web/20190812123147js_/https://neo4j.com/docs/operations-manual/3.4/javascript/colorize.js" type="text/javascript"></script><script src="/web/20190812123147js_/https://neo4j.com/docs/operations-manual/3.4/javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="/web/20190812123147js_/https://neo4j.com/docs/operations-manual/3.4/javascript/mp-nav.js" type="text/javascript"></script><script src="/web/20190812123147js_/https://neo4j.com/docs/operations-manual/3.4/javascript/versionswitcher.js" type="text/javascript"></script><script src="/web/20190812123147js_/https://neo4j.com/docs/operations-manual/3.4/javascript/version.js" type="text/javascript"></script><script src="//web.archive.org/web/20190812123147js_/https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="This section describes the Neo4j Cypher Shell."></meta>
      <link rel="prev" href="/web/20190812123147/https://neo4j.com/docs/operations-manual/3.4/tools/unbind/" title="11.8. Unbind a Core Server"></link>
      <link rel="next" href="/web/20190812123147/https://neo4j.com/docs/operations-manual/3.4/reference/" title="Appendix A. Reference"></link>
      <link rel="shortcut icon" href="https://web.archive.org/web/20190812123147im_/https://neo4j.com/wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../" id="logo"><img src="https://web.archive.org/web/20190812123147/https://neo4j.com/wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body><!-- BEGIN WAYBACK TOOLBAR INSERT -->
<script>__wm.rw(0);</script>
<div id="wm-ipp-base" lang="en" style="display:none;direction:ltr;" toolbar-mode="auto">
<div id="wm-ipp" style="position:fixed;left:0;top:0;right:0;">
<div id="donato" style="position:relative;width:100%;height:0;">
  <div id="donato-base">
    <iframe id="donato-if" src="https://archive.org/includes/donate.php?as_page=1&amp;platform=wb&amp;referer=https%3A//web.archive.org/web/20190812123147/https%3A//neo4j.com/docs/operations-manual/3.4/tools/cypher-shell/"
	    scrolling="no" frameborder="0" style="width:100%; height:100%">
    </iframe>
  </div>
</div><div id="wm-ipp-inside">
  <div id="wm-toolbar" style="position:relative;display:flex;flex-flow:row nowrap;justify-content:space-between;">
    <div id="wm-logo" style="/*width:110px;*/padding-top:12px;">
      <a href="/web/" title="Wayback Machine home page"><img src="https://web-static.archive.org/_static/images/toolbar/wayback-toolbar-logo-200.png" srcset="https://web-static.archive.org/_static/images/toolbar/wayback-toolbar-logo-100.png, https://web-static.archive.org/_static/images/toolbar/wayback-toolbar-logo-150.png 1.5x, https://web-static.archive.org/_static/images/toolbar/wayback-toolbar-logo-200.png 2x" alt="Wayback Machine" style="width:100px" border="0" /></a>
    </div>
    <div class="c" style="display:flex;flex-flow:column nowrap;justify-content:space-between;flex:1;">
      <form class="u" style="display:flex;flex-direction:row;flex-wrap:nowrap;" target="_top" method="get" action="/web/submit" name="wmtb" id="wmtb"><input type="text" name="url" id="wmtbURL" value="https://neo4j.com/docs/operations-manual/3.4/tools/cypher-shell/" onfocus="this.focus();this.select();" style="flex:1;"/><input type="hidden" name="type" value="replay" /><input type="hidden" name="date" value="20190812123147" /><input type="submit" value="Go" />
      </form>
      <div style="display:flex;flex-flow:row nowrap;align-items:flex-end;">
                <div class="s" id="wm-nav-captures" style="flex:1;">
                    <a class="t" href="/web/20190812123147*/https://neo4j.com/docs/operations-manual/3.4/tools/cypher-shell/" title="See a list of every capture for this URL">1 capture</a>
          <div class="r" title="Timespan for captures of this URL">12 Aug 2019</div>
          </div>
        <div class="k">
          <a href="" id="wm-graph-anchor">
            <div id="wm-ipp-sparkline" title="Explore captures for this URL" style="position: relative">
              <canvas id="wm-sparkline-canvas" width="750" height="27" border="0"></canvas>
            </div>
          </a>
        </div>
      </div>
    </div>
    <div class="n">
      <table>
        <tbody>
          <!-- NEXT/PREV MONTH NAV AND MONTH INDICATOR -->
          <tr class="m">
            <td class="b" nowrap="nowrap">Jul</td>
            <td class="c" id="displayMonthEl" title="You are here: 12:31:47 Aug 12, 2019">AUG</td>
            <td class="f" nowrap="nowrap">Sep</td>
          </tr>
          <!-- NEXT/PREV CAPTURE NAV AND DAY OF MONTH INDICATOR -->
          <tr class="d">
            <td class="b" nowrap="nowrap"><img src="https://web-static.archive.org/_static/images/toolbar/wm_tb_prv_off.png" alt="Previous capture" width="14" height="16" border="0" /></td>
            <td class="c" id="displayDayEl" style="width:34px;font-size:22px;white-space:nowrap;" title="You are here: 12:31:47 Aug 12, 2019">12</td>
            <td class="f" nowrap="nowrap"><img src="https://web-static.archive.org/_static/images/toolbar/wm_tb_nxt_off.png" alt="Next capture" width="14" height="16" border="0" /></td>
          </tr>
          <!-- NEXT/PREV YEAR NAV AND YEAR INDICATOR -->
          <tr class="y">
            <td class="b" nowrap="nowrap">2018</td>
            <td class="c" id="displayYearEl" title="You are here: 12:31:47 Aug 12, 2019">2019</td>
            <td class="f" nowrap="nowrap">2020</td>
          </tr>
        </tbody>
      </table>
    </div>
    <div class="r" style="display:flex;flex-flow:column nowrap;align-items:flex-end;justify-content:space-between;">
      <div id="wm-btns" style="text-align:right;height:23px;">
                <span class="xxs">
          <div id="wm-save-snapshot-success">success</div>
          <div id="wm-save-snapshot-fail">fail</div>
          <a id="wm-save-snapshot-open" href="#" title="Share via My Web Archive" >
            <span class="iconochive-web"></span>
          </a>
          <a href="https://archive.org/account/login.php" title="Sign In" id="wm-sign-in">
            <span class="iconochive-person"></span>
          </a>
          <span id="wm-save-snapshot-in-progress" class="iconochive-web"></span>
        </span>
                <a class="xxs" href="http://faq.web.archive.org/" title="Get some help using the Wayback Machine" style="top:-6px;"><span class="iconochive-question" style="color:rgb(87,186,244);font-size:160%;"></span></a>
        <a id="wm-tb-close" href="#close" style="top:-2px;" title="Close the toolbar"><span class="iconochive-remove-circle" style="color:#888888;font-size:240%;"></span></a>
      </div>
      <div id="wm-share" class="xxs">
        <a href="/web/20190812123147/http://web.archive.org/screenshot/https://neo4j.com/docs/operations-manual/3.4/tools/cypher-shell/"
           id="wm-screenshot"
           title="screenshot">
          <span class="wm-icon-screen-shot"></span>
        </a>
        <a href="#" id="wm-video" title="video">
          <span class="iconochive-movies"></span>
        </a>
        <a id="wm-share-facebook" href="#" data-url="https://web.archive.org/web/20190812123147/https://neo4j.com/docs/operations-manual/3.4/tools/cypher-shell/" title="Share on Facebook" style="margin-right:5px;" target="_blank"><span class="iconochive-facebook" style="color:#3b5998;font-size:160%;"></span></a>
        <a id="wm-share-twitter" href="#" data-url="https://web.archive.org/web/20190812123147/https://neo4j.com/docs/operations-manual/3.4/tools/cypher-shell/" title="Share on Twitter" style="margin-right:5px;" target="_blank"><span class="iconochive-twitter" style="color:#1dcaff;font-size:160%;"></span></a>
      </div>
      <div style="padding-right:2px;text-align:right;white-space:nowrap;">
        <a id="wm-expand" class="wm-btn wm-closed" href="#expand"><span id="wm-expand-icon" class="iconochive-down-solid"></span> <span class="xxs" style="font-size:80%;">About this capture</span></a>
      </div>
    </div>
  </div>
    <div id="wm-capinfo" style="border-top:1px solid #777;display:none; overflow: hidden">
        <div id="wm-capinfo-notice" source="api"></div>
                <div id="wm-capinfo-collected-by">
    <div style="background-color:#666;color:#fff;font-weight:bold;text-align:center">COLLECTED BY</div>
    <div style="padding:3px;position:relative" id="wm-collected-by-content">
            <div style="display:inline-block;vertical-align:top;width:50%;">
			<span class="c-logo" style="background-image:url(https://archive.org/services/img/webwidecrawl);"></span>
		Organization: <a style="color:#33f;" href="https://archive.org/details/webwidecrawl" target="_new"><span class="wm-title">Internet Archive</span></a>
		<div style="max-height:75px;overflow:hidden;position:relative;">
	  <div style="position:absolute;top:0;left:0;width:100%;height:75px;background:linear-gradient(to bottom,rgba(255,255,255,0) 0%,rgba(255,255,255,0) 90%,rgba(255,255,255,255) 100%);"></div>
	  The Internet Archive discovers and captures web pages through many different web crawls.

At any given time several distinct crawls are running, some for months, and some every day or longer.

View the web archive through the <a href="http://archive.org/web/web.php">Wayback Machine</a>.
	</div>
	      </div>
      <div style="display:inline-block;vertical-align:top;width:49%;">
			<span class="c-logo" style="background-image:url(https://archive.org/services/img/wide00017)"></span>
		<div>Collection: <a style="color:#33f;" href="https://archive.org/details/wide00017" target="_new"><span class="wm-title">Wide Crawl Number 17: Started August 3rd, 2018</span></a></div>
		<div style="max-height:75px;overflow:hidden;position:relative;">
	  <div style="position:absolute;top:0;left:0;width:100%;height:75px;background:linear-gradient(to bottom,rgba(255,255,255,0) 0%,rgba(255,255,255,0) 90%,rgba(255,255,255,255) 100%);"></div>
	  <div><span style="font-size: 16px; font-family: Arial;">Wide17 was seeded with the "Total Domains" list of 256,796,456 URLs provided by&nbsp;</span><span style="font-size: 16px; font-family: Arial;"><a href="https://domains-index.com">Domains Index</a>&nbsp;</span><span style="font-size: 16px; font-family: Arial;">on June 26th, and crawled with max-hops set to "3" and de-duplication set "on".</span><br style="font-size: 16px; font-family: Arial;"></div><div>&nbsp;&nbsp;</div>
	</div>
	      </div>
    </div>
    </div>
    <div id="wm-capinfo-timestamps">
    <div style="background-color:#666;color:#fff;font-weight:bold;text-align:center" title="Timestamps for the elements of this page">TIMESTAMPS</div>
    <div>
      <div id="wm-capresources" style="margin:0 5px 5px 5px;max-height:250px;overflow-y:scroll !important"></div>
      <div id="wm-capresources-loading" style="text-align:left;margin:0 20px 5px 5px;display:none"><img src="https://web-static.archive.org/_static/images/loading.gif" alt="loading" /></div>
    </div>
    </div>
  </div></div></div></div><div id="wm-ipp-print">The Wayback Machine - https://web.archive.org/web/20190812123147/https://neo4j.com/docs/operations-manual/3.4/tools/cypher-shell/</div>
<script type="text/javascript">//<![CDATA[
__wm.bt(750,27,25,2,"web","https://neo4j.com/docs/operations-manual/3.4/tools/cypher-shell/","20190812123147",1996,"https://web-static.archive.org/_static/",["https://web-static.archive.org/_static/css/banner-styles.css?v=1B2M2Y8A","https://web-static.archive.org/_static/css/iconochive.css?v=1B2M2Y8A"], false);
  __wm.rw(1);
//]]></script>
<!-- END WAYBACK TOOLBAR INSERT -->
 
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://web.archive.org/web/20190812123147/https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="https://web.archive.org/web/20190812123147/https://neo4j.com/docs/developer-manual/3.4/">Developer Manual</a></li>
            <li><a href="https://web.archive.org/web/20190812123147/https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://web.archive.org/web/20190812123147/https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://web.archive.org/web/20190812123147/https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="/web/20190812123147/https://neo4j.com/docs/operations-manual/3.4/tools/unbind/"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Unbind a Core Server</a></span><span class="nav-current">
               <p class="nav-title hidden">11.9.&nbsp;Cypher Shell</p></span><span class="nav-next"><a accesskey="n" href="/web/20190812123147/https://neo4j.com/docs/operations-manual/3.4/reference/">Reference<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="cypher-shell">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a class="anchor" href="#cypher-shell"></a>11.9.&nbsp;Cypher Shell
                  </h2>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>This section describes the Neo4j Cypher Shell.</p>
         </div>
         <p>Cypher Shell is a command-line tool that is installed as part of the product.
            You can connect to a Neo4j database and use Cypher to query data, define schema or perform administrative tasks.
            Cypher Shell exposes explicit transactions allowing multiple operations to be grouped and applied or rolled back together.
            Cypher Shell communicates via the binary protocol Bolt.
         </p>
         <section class="section" id="cypher-shell-syntax">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a class="anchor" href="#cypher-shell-syntax"></a>11.9.1.&nbsp;Invoking Cypher Shell
                     </h3>
                  </div>
               </div>
            </div>
            <p>Cypher Shell is located in the <code class="literal">bin</code> directory and is invoked with a set of arguments.
            </p>
            <p><code class="literal">cypher-shell [-h] [-a ADDRESS] [-u USERNAME] [-p PASSWORD] [--encryption {true,false}] [--format {verbose,plain}] [--debug]
                  [--non-interactive] [-v] [--fail-fast | --fail-at-end] [cypher]</code></p>
            <p><span class="strong"><strong>Arguments</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e22186">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><span class="strong"><strong>Positional arguments:</strong></span></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">&nbsp;</td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>cypher</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An optional string of cypher to execute and then exit.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><span class="strong"><strong>Optional arguments:</strong></span></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">&nbsp;</td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-h, --help</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Show help message and exit.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--fail-fast</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Exit and report failure on first error when reading from file (this is the default behavior).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--fail-at-end</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Exit and report failures at end of input when reading from file.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--format {auto,verbose,plain}</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Desired output format. <code class="literal">auto</code> displays results in tabular format if you use the shell interactively and with minimal formatting if you use it for scripting.
                                 <code class="literal">verbose</code> displays results in tabular format and prints statistics and <code class="literal">plain</code> displays data with minimal formatting (default: auto).
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--debug</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Print additional debug information (default: false).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--non-interactive</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Force non-interactive mode; only useful if auto-detection fails (default: false).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-v, --version</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Print version of cypher-shell and exit (default: false).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><span class="strong"><strong>Connection arguments:</strong></span></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">&nbsp;</td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-a ADDRESS, --address  ADDRESS</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Address and port to connect to (default: bolt://localhost:7687).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-u USERNAME, --username  USERNAME</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Username to connect as. Can also be specified using environment variable NEO4J_USERNAME (default: ).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-p PASSWORD, --password   PASSWORD</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Password to connect with. Can also be specified using environment variable NEO4J_PASSWORD (default: ).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--encryption {true,false}</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Whether the connection to Neo4j should be encrypted; must be consistent with Neo4j&#8217;s configuration (default: true).</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <div class="example" id="d0e22302">
               <div class="example-title">Example&nbsp;11.16.&nbsp;Invoke Cypher Shell with username and password</div>
               <div class="example-contents"><pre class="programlisting highlight"><code data-lang="cypher">$neo4j-home&gt; bin/cypher-shell -u johndoe -p secret</code></pre><pre class="screen highlight"><code>Connected to Neo4j at bolt://localhost:7687 as user neo4j.
Type :help for a list of available commands or :exit to exit the shell.
Note that Cypher queries must end with a semicolon.
neo4j&gt;</code></pre></div>
            </div>
            <div class="example" id="d0e22309">
               <div class="example-title">Example&nbsp;11.17.&nbsp;Invoke help from within Cypher Shell</div>
               <div class="example-contents"><pre class="programlisting highlight"><code data-lang="cypher">neo4j&gt; :help</code></pre><pre class="screen highlight"><code>Available commands:
  :begin    Open a transaction
  :commit   Commit the currently open transaction
  :exit     Exit the logger
  :help     Show this help message
  :history  Print a list of the last commands executed
  :param    Set the value of a query parameter
  :params   Prints all currently set query parameters and their values
  :rollback Rollback the currently open transaction

For help on a specific command type:
    :help command</code></pre></div>
            </div>
            <div class="example" id="d0e22316">
               <div class="example-title">Example&nbsp;11.18.&nbsp;Execute a query from within Cypher Shell</div>
               <div class="example-contents"><pre class="programlisting highlight"><code data-lang="cypher">neo4j&gt; MATCH (n) RETURN n;</code></pre><pre class="screen highlight"><code>+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
+-----------------------------------------------------------------+</code></pre></div>
            </div>
            <div class="example" id="d0e22323">
               <div class="example-title">Example&nbsp;11.19.&nbsp;Invoke Cypher Shell with a Cypher script from the command line</div>
               <div class="example-contents">
                  <p>Below is the contents of a file called examples.cypher:</p><pre class="screen highlight"><code>MATCH (n) RETURN n;

MATCH (batman:Person {name: 'Bruce Wayne'}) RETURN batman;</code></pre><p>Invoke the 'examples.cypher' script from the command-line.
                     All the examples in the remainder of this section will use the <code class="literal">--format plain</code> flag for a simple output.
                  </p><pre class="screen highlight"><code>$neo4j-home&gt; cat examples.cypher | bin/cypher-shell -u neo4j -p secret --format plain</code></pre><pre class="screen highlight"><code>n
(:Person {name: "Bruce Wayne", alias: "Batman"})
(:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]})
batman
(:Person {name: "Bruce Wayne", alias: "Batman"})</code></pre></div>
            </div>
         </section>
         <section class="section" id="cypher-shell-parameters">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a class="anchor" href="#cypher-shell-parameters"></a>11.9.2.&nbsp;Query parameters
                     </h3>
                  </div>
               </div>
            </div>
            <p>Cypher Shell supports querying based on parameters.
               This is often used while scripting.
            </p>
            <div class="example" id="d0e22344">
               <div class="example-title">Example&nbsp;11.20.&nbsp;Use parameters within Cypher Shell</div>
               <div class="example-contents">
                  <p>Set the parameter 'thisAlias' to 'Robin' using the ':param' keyword.
                     Check the parameter using the ':params' keyword.
                  </p><pre class="screen highlight"><code>neo4j&gt; :param thisAlias =&gt; 'Robin'
neo4j&gt; :params
:param thisAlias =&gt; 'Robin'</code></pre><p>Now use the parameter 'thisAlias' in a Cypher query.
                     Verify the result.
                  </p><pre class="screen highlight"><code>neo4j&gt; CREATE (:Person {name : 'Dick Grayson', alias : {thisAlias} });
Added 1 nodes, Set 2 properties, Added 1 labels
neo4j&gt; MATCH (n) RETURN n;
+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
| (:Person {name: "Dick Grayson", alias: "Robin"})                |
+-----------------------------------------------------------------+
3 rows available after 2 ms, consumed after another 2 ms</code></pre></div>
            </div>
         </section>
         <section class="section" id="cypher-shell-transactions">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a class="anchor" href="#cypher-shell-transactions"></a>11.9.3.&nbsp;Transactions
                     </h3>
                  </div>
               </div>
            </div>
            <p>Cypher Shell supports explicit transactions.
               Transaction states are controlled using the keywords <code class="literal">:begin</code>, <code class="literal">:commit</code>, and <code class="literal">:rollback</code>:
            </p>
            <div class="example" id="d0e22369">
               <div class="example-title">Example&nbsp;11.21.&nbsp;Use fine-grained transaction control</div>
               <div class="example-contents">
                  <p>Start a transaction in your first Cypher Shell session:</p><pre class="screen highlight"><code>neo4j&gt; MATCH (n) RETURN n;
+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
| (:Person {name: "Dick Grayson", alias: "Robin"})                |
+-----------------------------------------------------------------+
3 rows available after 2 ms, consumed after another 2 ms
neo4j&gt; :begin
neo4j# CREATE (:Person {name : 'Edward Mygma', alias : 'The Riddler' });</code></pre><p>If you now open up a second Cypher Shell session, you will notice no changes from the latest <code class="literal">CREATE</code> statement:
                  </p><pre class="screen highlight"><code>neo4j&gt; MATCH (n) RETURN n;
+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
| (:Person {name: "Dick Grayson", alias: "Robin"})                |
+-----------------------------------------------------------------+
3 rows available after 2 ms, consumed after another 2 ms</code></pre><p>Go back to the first session and commit the transaction:</p><pre class="screen highlight"><code>neo4j# :commit
0 rows available after 1 ms, consumed after another 0 ms
Added 1 nodes, Set 2 properties, Added 1 labels
neo4j&gt; MATCH (n) RETURN n;
+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
| (:Person {name: "Dick Grayson", alias: "Robin"})                |
| (:Person {name: "Edward Mygma", alias: "The Riddler"})          |
+-----------------------------------------------------------------+
4 rows available after 1 ms, consumed after another 1 ms

neo4j&gt;</code></pre></div>
            </div>
         </section>
         <section class="section" id="cypher-shell-procedures">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a class="anchor" href="#cypher-shell-procedures"></a>11.9.4.&nbsp;Procedures
                     </h3>
                  </div>
               </div>
            </div>
            <p>Cypher Shell supports running any procedures for which the current user is authorized.
               Here, we are using the natively built-in procedure <code class="literal">dbms.showCurrentUser()</code>.
            </p>
            <div class="example" id="d0e22395">
               <div class="example-title">Example&nbsp;11.22.&nbsp;Call a procedure from within Cypher Shell</div>
               <div class="example-contents"><pre class="screen highlight"><code>neo4j&gt; CALL dbms.showCurrentUser();
+------------------------------+
| username | roles     | flags |
+------------------------------+
| "neo4j"  | ["admin"] | []    |
+------------------------------+

1 row available after 66 ms, consumed after another 2 ms
neo4j&gt; :exit</code></pre></div>
            </div>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//web.archive.org/web/20190812123147/https://www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//web.archive.org/web/20190812123147/https://munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html><!--
     FILE ARCHIVED ON 12:31:47 Aug 12, 2019 AND RETRIEVED FROM THE
     INTERNET ARCHIVE ON 15:42:24 Jul 04, 2025.
     JAVASCRIPT APPENDED BY WAYBACK MACHINE, COPYRIGHT INTERNET ARCHIVE.

     ALL OTHER CONTENT MAY ALSO BE PROTECTED BY COPYRIGHT (17 U.S.C.
     SECTION 108(a)(3)).
-->
<!--
playback timings (ms):
  captures_list: 0.838
  exclusion.robots: 0.041
  exclusion.robots.policy: 0.025
  esindex: 0.016
  cdx.remote: 23.567
  LoadShardBlock: 438.569 (3)
  PetaboxLoader3.datanode: 247.314 (4)
  PetaboxLoader3.resolve: 335.854 (2)
  load_resource: 164.589
-->