

<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">

      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>11.9.&nbsp;Cypher Shell - Chapter&nbsp;11.&nbsp;Tools</title>
      <link rel="stylesheet" type="text/css" href="../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../css/chunked-base.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/powershell/powershell.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../javascript/colorize.js" type="text/javascript"></script><script src="../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="This section describes the Neo4j Cypher Shell."></meta>
      <link rel="prev" href="../../tools/unbind/" title="11.8. Unbind a Core Server"></link>
      <link rel="next" href="../../reference/" title="Appendix A. Reference"></link>
      <link rel="shortcut icon" href="../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../" id="logo"><img src="../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
 
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="../../">Operations Manual</a></li>
            <li><a href="../../docs/developer-manual/3.4/">Developer Manual</a></li>
            <li><a href="../../docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="../../docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="../../docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../../tools/unbind/"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Unbind a Core Server</a></span><span class="nav-current">
               <p class="nav-title hidden">11.9.&nbsp;Cypher Shell</p></span><span class="nav-next"><a accesskey="n" href="../../reference/">Reference<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="cypher-shell">
         <div class="titlepage">
            <div>
               <div>
                  <h2 class="title" style="clear: both"><a class="anchor" href="#cypher-shell"></a>11.9.&nbsp;Cypher Shell
                  </h2>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>This section describes the Neo4j Cypher Shell.</p>
         </div>
         <p>Cypher Shell is a command-line tool that is installed as part of the product.
            You can connect to a Neo4j database and use Cypher to query data, define schema or perform administrative tasks.
            Cypher Shell exposes explicit transactions allowing multiple operations to be grouped and applied or rolled back together.
            Cypher Shell communicates via the binary protocol Bolt.
         </p>
         <section class="section" id="cypher-shell-syntax">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a class="anchor" href="#cypher-shell-syntax"></a>11.9.1.&nbsp;Invoking Cypher Shell
                     </h3>
                  </div>
               </div>
            </div>
            <p>Cypher Shell is located in the <code class="literal">bin</code> directory and is invoked with a set of arguments.
            </p>
            <p><code class="literal">cypher-shell [-h] [-a ADDRESS] [-u USERNAME] [-p PASSWORD] [--encryption {true,false}] [--format {verbose,plain}] [--debug]
                  [--non-interactive] [-v] [--fail-fast | --fail-at-end] [cypher]</code></p>
            <p><span class="strong"><strong>Arguments</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e22186">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><span class="strong"><strong>Positional arguments:</strong></span></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">&nbsp;</td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>cypher</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An optional string of cypher to execute and then exit.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><span class="strong"><strong>Optional arguments:</strong></span></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">&nbsp;</td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-h, --help</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Show help message and exit.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--fail-fast</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Exit and report failure on first error when reading from file (this is the default behavior).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--fail-at-end</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Exit and report failures at end of input when reading from file.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--format {auto,verbose,plain}</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Desired output format. <code class="literal">auto</code> displays results in tabular format if you use the shell interactively and with minimal formatting if you use it for scripting.
                                 <code class="literal">verbose</code> displays results in tabular format and prints statistics and <code class="literal">plain</code> displays data with minimal formatting (default: auto).
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--debug</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Print additional debug information (default: false).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--non-interactive</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Force non-interactive mode; only useful if auto-detection fails (default: false).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-v, --version</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Print version of cypher-shell and exit (default: false).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><span class="strong"><strong>Connection arguments:</strong></span></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">&nbsp;</td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-a ADDRESS, --address  ADDRESS</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Address and port to connect to (default: bolt://localhost:7687).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-u USERNAME, --username  USERNAME</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Username to connect as. Can also be specified using environment variable NEO4J_USERNAME (default: ).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>-p PASSWORD, --password   PASSWORD</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Password to connect with. Can also be specified using environment variable NEO4J_PASSWORD (default: ).</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>--encryption {true,false}</p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Whether the connection to Neo4j should be encrypted; must be consistent with Neo4j&#8217;s configuration (default: true).</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <div class="example" id="d0e22302">
               <div class="example-title">Example&nbsp;11.16.&nbsp;Invoke Cypher Shell with username and password</div>
               <div class="example-contents"><pre class="programlisting highlight"><code data-lang="cypher">$neo4j-home&gt; bin/cypher-shell -u johndoe -p secret</code></pre><pre class="screen highlight"><code>Connected to Neo4j at bolt://localhost:7687 as user neo4j.
Type :help for a list of available commands or :exit to exit the shell.
Note that Cypher queries must end with a semicolon.
neo4j&gt;</code></pre></div>
            </div>
            <div class="example" id="d0e22309">
               <div class="example-title">Example&nbsp;11.17.&nbsp;Invoke help from within Cypher Shell</div>
               <div class="example-contents"><pre class="programlisting highlight"><code data-lang="cypher">neo4j&gt; :help</code></pre><pre class="screen highlight"><code>Available commands:
  :begin    Open a transaction
  :commit   Commit the currently open transaction
  :exit     Exit the logger
  :help     Show this help message
  :history  Print a list of the last commands executed
  :param    Set the value of a query parameter
  :params   Prints all currently set query parameters and their values
  :rollback Rollback the currently open transaction

For help on a specific command type:
    :help command</code></pre></div>
            </div>
            <div class="example" id="d0e22316">
               <div class="example-title">Example&nbsp;11.18.&nbsp;Execute a query from within Cypher Shell</div>
               <div class="example-contents"><pre class="programlisting highlight"><code data-lang="cypher">neo4j&gt; MATCH (n) RETURN n;</code></pre><pre class="screen highlight"><code>+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
+-----------------------------------------------------------------+</code></pre></div>
            </div>
            <div class="example" id="d0e22323">
               <div class="example-title">Example&nbsp;11.19.&nbsp;Invoke Cypher Shell with a Cypher script from the command line</div>
               <div class="example-contents">
                  <p>Below is the contents of a file called examples.cypher:</p><pre class="screen highlight"><code>MATCH (n) RETURN n;

MATCH (batman:Person {name: 'Bruce Wayne'}) RETURN batman;</code></pre><p>Invoke the 'examples.cypher' script from the command-line.
                     All the examples in the remainder of this section will use the <code class="literal">--format plain</code> flag for a simple output.
                  </p><pre class="screen highlight"><code>$neo4j-home&gt; cat examples.cypher | bin/cypher-shell -u neo4j -p secret --format plain</code></pre><pre class="screen highlight"><code>n
(:Person {name: "Bruce Wayne", alias: "Batman"})
(:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]})
batman
(:Person {name: "Bruce Wayne", alias: "Batman"})</code></pre></div>
            </div>
         </section>
         <section class="section" id="cypher-shell-parameters">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a class="anchor" href="#cypher-shell-parameters"></a>11.9.2.&nbsp;Query parameters
                     </h3>
                  </div>
               </div>
            </div>
            <p>Cypher Shell supports querying based on parameters.
               This is often used while scripting.
            </p>
            <div class="example" id="d0e22344">
               <div class="example-title">Example&nbsp;11.20.&nbsp;Use parameters within Cypher Shell</div>
               <div class="example-contents">
                  <p>Set the parameter 'thisAlias' to 'Robin' using the ':param' keyword.
                     Check the parameter using the ':params' keyword.
                  </p><pre class="screen highlight"><code>neo4j&gt; :param thisAlias =&gt; 'Robin'
neo4j&gt; :params
:param thisAlias =&gt; 'Robin'</code></pre><p>Now use the parameter 'thisAlias' in a Cypher query.
                     Verify the result.
                  </p><pre class="screen highlight"><code>neo4j&gt; CREATE (:Person {name : 'Dick Grayson', alias : {thisAlias} });
Added 1 nodes, Set 2 properties, Added 1 labels
neo4j&gt; MATCH (n) RETURN n;
+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
| (:Person {name: "Dick Grayson", alias: "Robin"})                |
+-----------------------------------------------------------------+
3 rows available after 2 ms, consumed after another 2 ms</code></pre></div>
            </div>
         </section>
         <section class="section" id="cypher-shell-transactions">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a class="anchor" href="#cypher-shell-transactions"></a>11.9.3.&nbsp;Transactions
                     </h3>
                  </div>
               </div>
            </div>
            <p>Cypher Shell supports explicit transactions.
               Transaction states are controlled using the keywords <code class="literal">:begin</code>, <code class="literal">:commit</code>, and <code class="literal">:rollback</code>:
            </p>
            <div class="example" id="d0e22369">
               <div class="example-title">Example&nbsp;11.21.&nbsp;Use fine-grained transaction control</div>
               <div class="example-contents">
                  <p>Start a transaction in your first Cypher Shell session:</p><pre class="screen highlight"><code>neo4j&gt; MATCH (n) RETURN n;
+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
| (:Person {name: "Dick Grayson", alias: "Robin"})                |
+-----------------------------------------------------------------+
3 rows available after 2 ms, consumed after another 2 ms
neo4j&gt; :begin
neo4j# CREATE (:Person {name : 'Edward Mygma', alias : 'The Riddler' });</code></pre><p>If you now open up a second Cypher Shell session, you will notice no changes from the latest <code class="literal">CREATE</code> statement:
                  </p><pre class="screen highlight"><code>neo4j&gt; MATCH (n) RETURN n;
+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
| (:Person {name: "Dick Grayson", alias: "Robin"})                |
+-----------------------------------------------------------------+
3 rows available after 2 ms, consumed after another 2 ms</code></pre><p>Go back to the first session and commit the transaction:</p><pre class="screen highlight"><code>neo4j# :commit
0 rows available after 1 ms, consumed after another 0 ms
Added 1 nodes, Set 2 properties, Added 1 labels
neo4j&gt; MATCH (n) RETURN n;
+-----------------------------------------------------------------+
| n                                                               |
+-----------------------------------------------------------------+
| (:Person {name: "Bruce Wayne", alias: "Batman"})                |
| (:Person {name: "Selina Kyle", alias: ["Catwoman", "The Cat"]}) |
| (:Person {name: "Dick Grayson", alias: "Robin"})                |
| (:Person {name: "Edward Mygma", alias: "The Riddler"})          |
+-----------------------------------------------------------------+
4 rows available after 1 ms, consumed after another 1 ms

neo4j&gt;</code></pre></div>
            </div>
         </section>
         <section class="section" id="cypher-shell-procedures">
            <div class="titlepage">
               <div>
                  <div>
                     <h3 class="title"><a class="anchor" href="#cypher-shell-procedures"></a>11.9.4.&nbsp;Procedures
                     </h3>
                  </div>
               </div>
            </div>
            <p>Cypher Shell supports running any procedures for which the current user is authorized.
               Here, we are using the natively built-in procedure <code class="literal">dbms.showCurrentUser()</code>.
            </p>
            <div class="example" id="d0e22395">
               <div class="example-title">Example&nbsp;11.22.&nbsp;Call a procedure from within Cypher Shell</div>
               <div class="example-contents"><pre class="screen highlight"><code>neo4j&gt; CALL dbms.showCurrentUser();
+------------------------------+
| username | roles     | flags |
+------------------------------+
| "neo4j"  | ["admin"] | []    |
+------------------------------+

1 row available after 66 ms, consumed after another 2 ms
neo4j&gt; :exit</code></pre></div>
            </div>
         </section>
      </section>
      <footer><script type="text/javascript">
        </script><script type="text/javascript">
        </script><script>;</script></footer>
   </body>
</html><!--
     FILE ARCHIVED ON 12:31:47 Aug 12, 2019 AND RETRIEVED FROM THE
     INTERNET ARCHIVE ON 15:42:24 Jul 04, 2025.
     JAVASCRIPT APPENDED BY WAYBACK MACHINE, COPYRIGHT INTERNET ARCHIVE.

     ALL OTHER CONTENT MAY ALSO BE PROTECTED BY COPYRIGHT (17 U.S.C.
     SECTION 108(a)(3)).
-->
<!--
-->